[    {
  "id":"one",
    "name": "You Trip",
    "image": "You-trip.jpg",
    "description": "My first group project from Bootcamp course. We collaborated as a group of 3 developers to create interactive website that suggest what kind of holidays is the best fit for your personality type. In this project I came up with the quiz and its logic, used local Storage as well as styled last two pages. We did use Bootstrap and ajax calls and learned how to collaborate as a group to make great things work! I really enjoyd how creative we could get during this assigment!!",
    "link": "https://ionb23.github.io/YouTrip/",
    "repoLink": "https://ionb23.github.io/YouTrip/"
  },
    {
      "id":"two",
      "name": "Weather Dashboard",
      "image": "Weather.jpg",
      "description": "This is one of the challengas completed for EdX Bootcamp. It is practise of third party APIs calls and asynchronous programing using then and response. I have p-ractised with moment.js, openweather API. All styling is done by Bootstrap only. ",
      "link": "https://frantiskaali.github.io/WeatherApp/?",
      "repoLink": "https://github.com/FrantiskaAli/WeatherApp/"
    },
    {
      "id":"five",
      "name": "Team Generator",
      "image": "teamGenerator.jpg",
      "description": "Team generator is in command line application that is run in terminal ,using node. Application need npm install in the terminal, then uses inquirer to ask series of question to generate fully functional html site containing information entered by the user.",
      "link": "https://frantiskaali.github.io/TeamProfileGenerator/",
      "repoLink": "https://github.com/FrantiskaAli/TeamProfileGenerator/"
    },
    {
      "id":"three",
      "name": "Task Organizer",
      "image": "taskOrganizer.jpg",
      "description": "This challenge had me focused on usage of moment.js creatively and practising local storage. You can save your daily task in each hour section of the working day. It is also my fisrt completely JavaScript generated HTML layout.",
      "link": "https://frantiskaali.github.io/TasksOrganizer/",
      "repoLink": "https://github.com/FrantiskaAli/TasksOrganizer/"
    },
    {
      "id":"four",
      "name": "Quiz Game",
      "image": "quizGame.jpg",
      "description": "This fun quiz game was first challange to get familiar with DOM manipulation! It opened many new doors for me as during working on this assigment I got confident using JavaScript to dynamically generate page content. Got familiar with timer function and localstorage!",
      "link": "https://frantiskaali.github.io/SimpleQuizGame/",
      "repoLink": "https://github.com/FrantiskaAli/SimpleQuizGame/"
    },
    
    {
      "id":"six",
      "name": "Bootstrap Portfolio",
      "image": "BootstrpPortfolio.jpg",
      "description": "In this simple project I practised my styling skill using lots of CSS in combination with Bootstrap to create my first portfolio! Here I really enjoyed designing original way how to present myselfand have learne a lot about Bootstrap classes and how to use them effectivelly. Also enjoyed Bootstraps selectionof components to make website seem interactive before I ve even learned any JS ! ",
      "link": "https://frantiskaali.github.io/FransBootstrapPortfolio/",
      "repoLink": "https://github.com/FrantiskaAli/FransBootstrapPortfolio/"
    }
]

   